app/controllers/bairros_controller.rb

SELECT "bairros".* FROM "bairros"
---
  def index
    @bairros = Bairro.all

INSERT INTO "bairros" ("descricao", "id_cidade", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["descricao", "Setor Santos Dumont"], ["id_cidade", 1], ["created_at", "2020-09-04 20:47:00.131176"], ["updated_at", "2020-09-04 20:47:00.131176"]]
---
  def create
    @bairro = Bairro.new(bairro_params)

    respond_to do |format|
      if @bairro.save

SELECT  "bairros".* FROM "bairros" WHERE "bairros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_bairro
      @bairro = Bairro.find(params[:id])