app/controllers/ceps_controller.rb

SELECT "ceps".* FROM "ceps"
---
  def index
    @ceps = Cep.all

INSERT INTO "ceps" ("descricao", "created_at", "updated_at") VALUES (?, ?, ?)  [["descricao", "74000000"], ["created_at", "2020-09-04 21:18:41.499949"], ["updated_at", "2020-09-04 21:18:41.499949"]]
---
  def create
    @cep = Cep.new(cep_params)

    respond_to do |format|
      if @cep.save

SELECT  "ceps".* FROM "ceps" WHERE "ceps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cep
      @cep = Cep.find(params[:id])