app/controllers/cidades_controller.rb

  def index
    @cidades = Cidade.all
---
SELECT "cidades".* FROM "cidades"

  def create
    @cidade = Cidade.new(cidade_params)

    respond_to do |format|
      if @cidade.save
---
INSERT INTO "cidades" ("descricao", "id_estado", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["descricao", "Goiania"], ["id_estado", 7], ["created_at", "2020-09-03 18:17:40.639428"], ["updated_at", "2020-09-03 18:17:40.639428"]]

  def update
    respond_to do |format|
      if @cidade.update(cidade_params)
---
UPDATE "cidades" SET "descricao" = ?, "updated_at" = ? WHERE "cidades"."id" = ?  [["descricao", "Goiania 2"], ["updated_at", "2020-09-03 22:02:27.243938"], ["id", 1]]

    def set_cidade
      @cidade = Cidade.find(params[:id])
---
SELECT  "cidades".* FROM "cidades" WHERE "cidades"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]