app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.all
---
SELECT "empresas".* FROM "empresas"

  def create
    @empresa = Empresa.new(empresa_params)

    respond_to do |format|
      if @empresa.save
---
INSERT INTO "empresas" ("razao_social", "fantasia", "id_endereco", "logo_tipo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_empresa
      @empresa = Empresa.find(params[:id])
---
SELECT  "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]