app/controllers/enderecos_controller.rb

SELECT "enderecos".* FROM "enderecos"
---
  def index
    @enderecos = Endereco.all

INSERT INTO "enderecos" ("descricao", "complemento", "numero", "id_bairro", "id_cep", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @endereco = Endereco.new(endereco_params)

    respond_to do |format|
      if @endereco.save

UPDATE "enderecos" SET "id_bairro" = ?, "updated_at" = ? WHERE "enderecos"."id" = ?  [["id_bairro", 2], ["updated_at", "2020-09-04 21:32:40.492725"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @endereco.update(endereco_params)

SELECT  "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_endereco
      @endereco = Endereco.find(params[:id])