app/controllers/estados_controller.rb

SELECT "estados".* FROM "estados"
---
  def index
    @estados = Estado.all

INSERT INTO "estados" ("descricao", "uf", "id_pais", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["descricao", "Goias"], ["uf", "GO"], ["id_pais", 1], ["created_at", "2020-09-03 15:37:09.183902"], ["updated_at", "2020-09-03 15:37:09.183902"]]
---
  def create
    @estado = Estado.new(estado_params)

    respond_to do |format|
      if @estado.save

UPDATE "estados" SET "id_pais" = ?, "updated_at" = ? WHERE "estados"."id" = ?  [["id_pais", 3], ["updated_at", "2020-09-03 17:20:18.490104"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @estado.update(estado_params)

DELETE FROM "estados" WHERE "estados"."id" = ?  [["id", 1]]
---
  def destroy
    @estado.destroy

SELECT  "estados".* FROM "estados" WHERE "estados"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_estado
      @estado = Estado.find(params[:id])