app/controllers/pais_controller.rb

SELECT "pais".* FROM "pais"
---
  def index
    @pais = Pai.all

INSERT INTO "pais" ("descricao", "created_at", "updated_at") VALUES (?, ?, ?)  [["descricao", "Brasil"], ["created_at", "2020-09-03 14:48:44.134570"], ["updated_at", "2020-09-03 14:48:44.134570"]]
---
  def create
    @pai = Pai.new(pai_params)

    respond_to do |format|
      if @pai.save

SELECT  "pais".* FROM "pais" WHERE "pais"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_pai
      @pai = Pai.find(params[:id])