app/controllers/tipo_documentos_controller.rb

SELECT "tipo_documentos".* FROM "tipo_documentos"
---
  def index
    @tipo_documentos = TipoDocumento.all

INSERT INTO "tipo_documentos" ("descricao", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["descricao", "RG"], ["status", 1], ["created_at", "2020-09-04 23:30:44.253293"], ["updated_at", "2020-09-04 23:30:44.253293"]]
---
  def create
    @tipo_documento = TipoDocumento.new(tipo_documento_params)

    respond_to do |format|
      if @tipo_documento.save

SELECT  "tipo_documentos".* FROM "tipo_documentos" WHERE "tipo_documentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tipo_documento
      @tipo_documento = TipoDocumento.find(params[:id])