app/controllers/tipo_enderecos_controller.rb

SELECT "tipo_enderecos".* FROM "tipo_enderecos"
---
  def index
    @tipo_enderecos = TipoEndereco.all

INSERT INTO "tipo_enderecos" ("descricao", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["descricao", "Avenida"], ["status", 1], ["created_at", "2020-09-04 23:33:25.745921"], ["updated_at", "2020-09-04 23:33:25.745921"]]
---
  def create
    @tipo_endereco = TipoEndereco.new(tipo_endereco_params)

    respond_to do |format|
      if @tipo_endereco.save

SELECT  "tipo_enderecos".* FROM "tipo_enderecos" WHERE "tipo_enderecos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tipo_endereco
      @tipo_endereco = TipoEndereco.find(params[:id])