app/controllers/usuarios_controller.rb

  def create

    @usuario = Usuario.new(usuario_params)

    @login = usuario_params[:user_name]

    consulta_existe = @usuario.existe_usuario_cadastro(@login)

    if not consulta_existe.nil? then
      redirect_to "/usuarios/#{consulta_existe[0].id}/edit"
    else
      respond_to do |format|
        if @usuario.save
---
INSERT INTO "usuarios" ("user_name", "senha", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_name", "teste"], ["senha", "123"], ["created_at", "2020-09-04 20:31:08.718307"], ["updated_at", "2020-09-04 20:31:08.718307"]]

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "senha" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["senha", "123"], ["updated_at", "2020-09-02 22:09:22.478340"], ["id", 1]]

  def destroy
    @usuario.destroy
---
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]