app/models/bairro.rb

  def consulta_nome(pid)
    return Bairro.select(:descricao).where("#{:id} = #{pid}")[0].descricao
---
SELECT "bairros"."descricao" FROM "bairros" WHERE (id = 1)