app/models/cep.rb

SELECT "ceps"."descricao" FROM "ceps" WHERE (id = 1)
---
  def consulta_nome(pid)
    return Cep.select(:descricao).where("#{:id} = #{pid}")[0].descricao