app/models/cidade.rb

  def consulta_nome(pid)
    return Cidade.select(:descricao).where("#{:id} = #{pid}")[0].descricao
---
SELECT "cidades"."descricao" FROM "cidades" WHERE (id = 1)