app/models/endereco.rb

  def consulta_nome(pid)
    return Endereco.select(:descricao).where("#{:id} = #{pid}")[0].descricao
---
SELECT "enderecos"."descricao" FROM "enderecos" WHERE (id = 1)