app/models/estado.rb

SELECT "estados"."descricao" FROM "estados" WHERE (id = 7)
---
  def consulta_nome(pid)
    return Estado.select(:descricao).where("#{:id} = #{pid}")[0].descricao