app/models/pai.rb

  def consulta_nome(pid)
    return Pai.select(:descricao).where("#{:id} = #{pid}")[0].descricao
---
SELECT "pais"."descricao" FROM "pais" WHERE (id = 1)