app/models/usuario.rb

SELECT COUNT(*) FROM "usuarios" WHERE (user_name = 'teste' and senha = '123' )
---
  def existe_usuario(pLogin, pSenha)

    consulta = Usuario.where("user_name = " + "'" + pLogin + "'" + " and senha = " + "'" + pSenha + "'" + " ")

    if consulta.size > 0 then

SELECT "usuarios"."id" FROM "usuarios" WHERE (user_name = 'teste')
SELECT COUNT(*) FROM "usuarios" WHERE (user_name = 'teste')
---
  def existe_usuario_cadastro(pUsername)

    # consulta = Usuario.select("id").where("user_name = " + "'" + pUsername + "'")
    consulta = Usuario.select(:id).where("#{:user_name} = " + "'" + pUsername + "'")

    if consulta.size > 0 then